applevald/gd32f303_project/mainapp/color_light.c
/*
 * WS2811 RGB LED驱动 - 使用硬件SPI2的MOSI引脚
 * 通过SPI编码模拟WS2811时序协议
 * 
 * 硬件连接：
 *   SPI2_MOSI (PB5) --> WS2811 DIN
 *   GND --> WS2811 GND
 *   5V --> WS2811 VCC
 * 
 * 工作原理：
 *   - SPI速率: 2.5MHz (每位0.4μs)
 *   - 0码: 0b11000000 (1.2μs高 + 2μs低)
 *   - 1码: 0b11111000 (2μs高 + 1.2μs低)
 *   - 每个颜色字节需要8个SPI字节编码
 */

#include <rtthread.h>
#include "board.h"
#include "drv_spi.h"
#include "gd32f30x_spi.h"

#define soft_spi_colorlight  /* 定义此宏以使用软件SPI实现WS2811驱动，注释掉则使用硬件SPI2 */

#ifndef soft_spi_colorlight
/* WS2811配置 */
#define WS2811_LED_NUM          3           /* LED数量 */
#define WS2811_COLOR_BITS       24          /* 每个LED的位数(GRB) */
#define WS2811_RESET_TIME_US    80          /* Reset时间(μs) */

/* SPI编码定义 */
/* 
 * SPI频率约6.75MHz时(每位约0.148μs)：
 * 0码 (T0H ~300ns): 2位高电平 -> 2*0.148us = 0.296us (符合WS2811要求)
 * 1码 (T1H ~600ns): 4位高电平 -> 4*0.148us = 0.592us (符合WS2811要求)
 */
#define WS2811_CODE_0           0xC0        /* 0码: 0b11000000 (2 high, 6 low) */
#define WS2811_CODE_1           0xF0        /* 1码: 0b11110000 (4 high, 4 low) */
#define WS2811_RESET_BYTE       0x00        /* Reset字节 */


/* 颜色缓冲区 */
static rt_uint8_t ws2811_buffer[WS2811_LED_NUM * WS2811_COLOR_BITS];  /* 编码后的数据 */
static struct gd32_spi_bus *spi_bus = RT_NULL;

/* 灯效线程句柄 */
static rt_thread_t light_thread = RT_NULL;

/* 灯效枚举 */
enum {
    LIGHT_EFFECT_NONE = 0,
    LIGHT_EFFECT_RGB_LOOP,
    LIGHT_EFFECT_FLOW,
    LIGHT_EFFECT_BREATH
};

/**
 * @brief  WS2811初始化
 * @retval RT_EOK: 成功, -RT_ERROR: 失败
 */
rt_err_t ws2811_init(void)
{
    rt_device_t spi_dev;
    
    rt_kprintf("WS2811: Initializing...\n");
    
    /* 查找SPI2设备 */
    spi_dev = rt_device_find("spi2");
    if (spi_dev == RT_NULL)
    {
        rt_kprintf("WS2811: ERROR - SPI2 device not found!\n");
        return -RT_ERROR;
    }
    
    /* 打开SPI2设备 */
    if (rt_device_open(spi_dev, RT_DEVICE_OFLAG_RDWR) != RT_EOK)
    {
        rt_kprintf("WS2811: Failed to open SPI2!\n");
        return -RT_ERROR;
    }
    
    /* 获取SPI总线结构 */
    spi_bus = (struct gd32_spi_bus *)spi_dev;
    
    /* 清空所有LED */
    rt_memset(ws2811_buffer, 0, sizeof(ws2811_buffer));
    
    rt_kprintf("WS2811: Initialized successfully on SPI2 (PB5)\n");
    return RT_EOK;
}

/**
 * @brief  将一个字节编码为8个SPI字节
 * @param  byte: 要编码的字节
 * @param  output: 输出缓冲区(至少8字节)
 */
static void ws2811_encode_byte(rt_uint8_t byte, rt_uint8_t *output)
{
    rt_uint8_t i;
    
    for (i = 0; i < 8; i++)
    {
        /* 从高位到低位编码 */
        if (byte & (0x80 >> i))
        {
            output[i] = WS2811_CODE_1;  /* 1码 */
        }
        else
        {
            output[i] = WS2811_CODE_0;  /* 0码 */
        }
    }
}

/**
 * @brief  设置单个LED的颜色
 * @param  index: LED索引(0-2)
 * @param  red: 红色分量(0-255)
 * @param  green: 绿色分量(0-255)
 * @param  blue: 蓝色分量(0-255)
 */
void ws2811_set_color(rt_uint8_t index, rt_uint8_t red, rt_uint8_t green, rt_uint8_t blue)
{
    rt_uint8_t *buf;
    
    if (index >= WS2811_LED_NUM)
    {
        return;
    }
    
    /* WS2811的颜色顺序是GRB */
    buf = &ws2811_buffer[index * WS2811_COLOR_BITS];
    
    /* 编码绿色 */
    ws2811_encode_byte(green, buf);
    buf += 8;
    
    /* 编码红色 */
    ws2811_encode_byte(red, buf);
    buf += 8;
    
    /* 编码蓝色 */
    ws2811_encode_byte(blue, buf);
}

/**
 * @brief  设置所有LED的颜色
 * @param  red: 红色分量(0-255)
 * @param  green: 绿色分量(0-255)
 * @param  blue: 蓝色分量(0-255)
 */
void ws2811_set_all(rt_uint8_t red, rt_uint8_t green, rt_uint8_t blue)
{
    rt_uint8_t i;
    
    for (i = 0; i < WS2811_LED_NUM; i++)
    {
        ws2811_set_color(i, red, green, blue);
    }
}

/**
 * @brief  更新LED显示
 * @note   将缓冲区数据发送到LED灯带
 */
void ws2811_update(void)
{
    // rt_uint8_t reset_buf[20];  /* Reset信号缓冲区 */
    
    if (spi_bus == RT_NULL)
    {
        rt_kprintf("WS2811: Not initialized!\n");
        return;
    }
    
    /* 发送颜色数据 */
    gd32_spi_send(spi_bus, ws2811_buffer, sizeof(ws2811_buffer));
    
    // /* 发送Reset信号(>50μs低电平) */
    // rt_memset(reset_buf, WS2811_RESET_BYTE, sizeof(reset_buf));
    // gd32_spi_send(spi_bus, reset_buf, sizeof(reset_buf));
    // rt_thread_mdelay(2);//帧间隔
}

/**
 * @brief  关闭所有LED
 */
void ws2811_clear(void)
{
    ws2811_set_all(0, 0, 0);
    ws2811_update();
}

/**
 * @brief  停止当前灯效线程
 */
void ws2811_stop_effect(void)
{
    if (light_thread != RT_NULL)
    {
        rt_thread_delete(light_thread);
        light_thread = RT_NULL;
    }
    
    ws2811_clear();
}

/* ==================== 测试函数 ==================== */

/**
 * @brief  RGB循环灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_rgb_entry(void *parameter)
{
    while (1)
    {
        ws2811_set_all(255, 0, 0);  /* RED */
        ws2811_update();
        rt_thread_mdelay(1000);
        
        ws2811_set_all(0, 255, 0);  /* GREEN */
        ws2811_update();
        rt_thread_mdelay(1000);
        
        ws2811_set_all(0, 0, 255);  /* BLUE */
        ws2811_update();
        rt_thread_mdelay(1000);
    }
}

/**
 * @brief  流水灯灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_flow_entry(void *parameter)
{
    while (1)
    {
        /* LED0 红色 */
        ws2811_set_color(0, 255, 0, 0);
        ws2811_set_color(1, 0, 0, 0);
        ws2811_set_color(2, 0, 0, 0);
        ws2811_update();
        rt_thread_mdelay(300);
        
        // /* LED1 绿色 */
        // ws2811_set_color(0, 0, 0, 0);
        // ws2811_set_color(1, 0, 255, 0);
        // ws2811_set_color(2, 0, 0, 0);
        // ws2811_update();
        // rt_thread_mdelay(300);
        
        // /* LED2 蓝色 */
        // ws2811_set_color(0, 0, 0, 0);
        // ws2811_set_color(1, 0, 0, 0);
        // ws2811_set_color(2, 0, 0, 255);
        // ws2811_update();
        // rt_thread_mdelay(300);
    }
}

/**
 * @brief  呼吸灯灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_breath_entry(void *parameter)
{
    rt_uint16_t brightness;
    
    while (1)
    {
        /* 渐亮 */
        for (brightness = 0; brightness <= 255; brightness += 5)
        {
            ws2811_set_all(brightness, brightness, brightness);
            ws2811_update();
            rt_thread_mdelay(20);
        }
        
