applevald/gd32f303_project/mainapp/color_light.c
        /* 渐暗 */
        for (brightness = 255; brightness > 0; brightness -= 5)
        {
            ws2811_set_all(brightness, brightness, brightness);
            ws2811_update();
            rt_thread_mdelay(20);
        }
    }
}

/**
 * @brief  测试函数：依次点亮红绿蓝 (循环运行)
 */
void ws2811_test_rgb(void)
{
    /* 检查是否已初始化 */
    if (spi_bus == RT_NULL)
    {
        if (ws2811_init() != RT_EOK)
        {
            return;
        }
    }
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_rgb",
                             ws2811_rgb_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: RGB loop started in background.\n");
    }
}

/**
 * @brief  测试函数：流水灯效果 (循环运行)
 */
void ws2811_test_flow(void)
{
    /* 检查是否已初始化 */
    if (spi_bus == RT_NULL)
    {
        if (ws2811_init() != RT_EOK)
        {
            return;
        }
    }
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_flow",
                             ws2811_flow_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: Flow effect started in background.\n");
    }
}

/**
 * @brief  测试函数：呼吸灯效果 (循环运行)
 */
void ws2811_test_breath(void)
{
    /* 检查是否已初始化 */
    if (spi_bus == RT_NULL)
    {
        if (ws2811_init() != RT_EOK)
        {
            return;
        }
    }
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_breath",
                             ws2811_breath_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: Breathing effect started in background.\n");
    }
}

/* MSH命令导出 */
#ifdef RT_USING_FINSH
#include <finsh.h>
MSH_CMD_EXPORT(ws2811_init, Initialize WS2811 LED driver);
MSH_CMD_EXPORT(ws2811_clear, Turn off all LEDs);
MSH_CMD_EXPORT(ws2811_stop_effect, Stop current lighting effect);
MSH_CMD_EXPORT(ws2811_test_rgb, Start RGB loop (background));
MSH_CMD_EXPORT(ws2811_test_flow, Start flow effect (background));
MSH_CMD_EXPORT(ws2811_test_breath, Start breathing effect (background));
#endif

#else

/* ==================== 软件SPI驱动WS2811实现 ==================== */

/* 软件SPI引脚定义 - 使用PB5作为数据引脚 */
#define WS2811_GPIO_PORT        GPIOB
#define WS2811_GPIO_PIN         GPIO_PIN_5
#define WS2811_GPIO_CLK         RCU_GPIOB

/* WS2811时序参数 (单位: 纳秒) */
#define WS2811_T0H_NS           300     /* 0码高电平时间: 300ns ±150ns */
#define WS2811_T0L_NS           900     /* 0码低电平时间: 900ns ±150ns */
#define WS2811_T1H_NS           600     /* 1码高电平时间: 600ns ±150ns */
#define WS2811_T1L_NS           600     /* 1码低电平时间: 600ns ±150ns */
#define WS2811_RESET_US         300      /* Reset时间: >50μs */

/* LED配置 */
#define WS2811_LED_NUM          3       /* LED数量 */

/* GPIO操作宏 */
#define WS2811_PIN_HIGH()       GPIO_BOP(WS2811_GPIO_PORT) = WS2811_GPIO_PIN
#define WS2811_PIN_LOW()        GPIO_BC(WS2811_GPIO_PORT) = WS2811_GPIO_PIN

/* 颜色缓冲区 */
static rt_uint8_t ws2811_color_buffer[WS2811_LED_NUM * 3];  /* GRB格式 */

/* 灯效线程句柄 */
static rt_thread_t light_thread = RT_NULL;

/**
 * @brief  微秒级延时 (精确延时,使用DWT)
 * @param  us: 延时时间(微秒)
 * @note   使用DWT(Data Watchpoint and Trace)单元实现精确延时
 */
static void delay_us(rt_uint32_t us)
{
    rt_uint32_t ticks = us * (SystemCoreClock / 1000000);
    rt_uint32_t told = SysTick->VAL;
    rt_uint32_t tnow, tcnt = 0;
    
    while (tcnt < ticks)
    {
        tnow = SysTick->VAL;
        if (tnow != told)
        {
            if (tnow < told)
            {
                tcnt += told - tnow;
            }
            else
            {
                tcnt += SysTick->LOAD - tnow + told;
            }
            told = tnow;
        }
    }
}

/**
 * @brief  精确内联延时宏 - T0H (350ns高电平)
 * @note   108MHz = 9.26ns/cycle
 *         WS2811标准: T0H=350ns±150ns (200-500ns有效范围)
 *         目标350ns → 38个NOP (保守值,易识别为0码)
 */
#define DELAY_T0H() do { \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
} while(0)

/**
 * @brief  精确内联延时宏 - T0L (800ns低电平)
 * @note   WS2811标准: T0L=800ns±150ns (650-950ns有效范围)
 *         目标800ns → 86个NOP (满足标准要求)
 */
#define DELAY_T0L() do { \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
} while(0)

#define DELAY_T1H() do { \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
} while(0)

#define DELAY_T1L() do { \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); \
} while(0)

/**
 * @brief  发送一个位到WS2811
 * @param  bit: 要发送的位 (0或1)
 * @note   使用内联宏实现精确时序
 */
static void ws2811_send_bit(rt_uint8_t bit)
{
    if (bit)
    {
        /* 发送1码: 600ns高 + 600ns低 */
        WS2811_PIN_HIGH();
        DELAY_T1H();
        WS2811_PIN_LOW();
        DELAY_T1L();
    }
    else
    {
        /* 发送0码: 300ns高 + 900ns低 */
        WS2811_PIN_HIGH();
        DELAY_T0H();
        WS2811_PIN_LOW();
        DELAY_T0L();
    }
}

/**
 * @brief  发送一个字节到WS2811
 * @param  byte: 要发送的字节
 * @note   高位在前
 */
static void ws2811_send_byte(rt_uint8_t byte)
{
    rt_uint8_t i;
    
