applevald/gd32f303_project/mainapp/color_light.c
    for (i = 0; i < 8; i++)
    {
        ws2811_send_bit((byte & 0x80) ? 1 : 0);
        byte <<= 1;
    }
}

/**
 * @brief  软件SPI WS2811初始化
 * @retval RT_EOK: 成功
 */
rt_err_t ws2811_init(void)
{
    rt_kprintf("WS2811: Initializing (Software SPI)...\n");
    
    /* 使能GPIO时钟 */
    rcu_periph_clock_enable(WS2811_GPIO_CLK);
    
    /* 配置GPIO为推挽输出,最高速度模式以获得最快的上升/下降沿 */
    gpio_init(WS2811_GPIO_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_MAX, WS2811_GPIO_PIN);
    
    /* 初始化为低电平 */
    WS2811_PIN_LOW();
    
    /* 清空颜色缓冲区 */
    rt_memset(ws2811_color_buffer, 0, sizeof(ws2811_color_buffer));
    
    rt_kprintf("WS2811: Initialized successfully on PB5 (Software SPI, MAX Speed)\n");
    return RT_EOK;
}

/**
 * @brief  设置单个LED的颜色
 * @param  index: LED索引(0-2)
 * @param  red: 红色分量(0-255)
 * @param  green: 绿色分量(0-255)
 * @param  blue: 蓝色分量(0-255)
 */
void ws2811_set_color(rt_uint8_t index, rt_uint8_t red, rt_uint8_t green, rt_uint8_t blue)
{
    if (index >= WS2811_LED_NUM)
    {
        return;
    }
    
    /* 根据实测，您的LED是RGB顺序(非标准GRB) */
    ws2811_color_buffer[index * 3 + 0] = red;    /* R */
    ws2811_color_buffer[index * 3 + 1] = green;  /* G */
    ws2811_color_buffer[index * 3 + 2] = blue;   /* B */
}

/**
 * @brief  设置所有LED的颜色
 * @param  red: 红色分量(0-255)
 * @param  green: 绿色分量(0-255)
 * @param  blue: 蓝色分量(0-255)
 */
void ws2811_set_all(rt_uint8_t red, rt_uint8_t green, rt_uint8_t blue)
{
    rt_uint8_t i;
    
    for (i = 0; i < WS2811_LED_NUM; i++)
    {
        ws2811_set_color(i, red, green, blue);
    }
}

/**
 * @brief  更新LED显示
 * @note   将缓冲区数据发送到LED灯带
 */
void ws2811_update(void)
{
    rt_uint16_t i;
    rt_base_t level;
    
    /* 关闭中断,保证时序准确性 */
    level = rt_hw_interrupt_disable();
    
    /* 发送所有LED的颜色数据 */
    for (i = 0; i < sizeof(ws2811_color_buffer); i++)
    {
        ws2811_send_byte(ws2811_color_buffer[i]);
    }
    
    /* Reset信号 (>50μs低电平) */
    WS2811_PIN_LOW();
    delay_us(300);  /* 300μs复位脉冲,足够让LED锁存数据 */
    
    /* 恢复中断 */
    rt_hw_interrupt_enable(level);
}

/**
 * @brief  关闭所有LED
 */
void ws2811_clear(void)
{
    ws2811_set_all(0, 0, 0);
    ws2811_update();
}

/**
 * @brief  强制复位WS2811 - 解除LED锁死状态
 * @note   发送超长复位脉冲清除LED内部状态机
 */
void ws2811_hard_reset(void)
{
    rt_kprintf("WS2811: Performing hard reset...\n");
    
    /* 发送1ms超长复位脉冲 */
    WS2811_PIN_LOW();
    delay_us(1000);
    
    /* 清空缓冲区 */
    rt_memset(ws2811_color_buffer, 0, sizeof(ws2811_color_buffer));
    
    /* 发送全0数据 */
    rt_base_t level = rt_hw_interrupt_disable();
    for (rt_uint16_t i = 0; i < sizeof(ws2811_color_buffer); i++)
    {
        ws2811_send_byte(0x00);
    }
    WS2811_PIN_LOW();
    delay_us(500);
    rt_hw_interrupt_enable(level);
    
    rt_kprintf("WS2811: Hard reset completed.\n");
}

/**
 * @brief  停止当前灯效线程
 */
void ws2811_stop_effect(void)
{
    if (light_thread != RT_NULL)
    {
        rt_thread_delete(light_thread);
        light_thread = RT_NULL;
    }
    
    ws2811_clear();
}

/* ==================== 灯效函数 ==================== */

/**
 * @brief  RGB循环灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_rgb_entry(void *parameter)
{
    while (1)
    {
        ws2811_set_all(255, 0, 0);  /* RED */
        ws2811_update();
        rt_thread_mdelay(1000);
        
        ws2811_set_all(0, 255, 0);  /* GREEN */
        ws2811_update();
        rt_thread_mdelay(1000);
        
        ws2811_set_all(0, 0, 255);  /* BLUE */
        ws2811_update();
        rt_thread_mdelay(1000);
    }
}

/**
 * @brief  流水灯灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_flow_entry(void *parameter)
{
    while (1)
    {
        /* LED0 红色 */
        ws2811_set_color(0, 255, 0, 0);
        ws2811_set_color(1, 0, 255, 0);
        ws2811_set_color(2, 0, 0, 255);
        ws2811_update();
        rt_thread_mdelay(300);
        
        // /* LED1 绿色 */
        // ws2811_set_color(0, 0, 0, 0);
        // ws2811_set_color(1, 0, 255, 0);
        // ws2811_set_color(2, 0, 0, 0);
        // ws2811_update();
        // rt_thread_mdelay(300);
        
        // /* LED2 蓝色 */
        // ws2811_set_color(0, 0, 0, 0);
        // ws2811_set_color(1, 0, 0, 0);
        // ws2811_set_color(2, 0, 0, 255);
        // ws2811_update();
        // rt_thread_mdelay(300);
    }
}

/**
 * @brief  呼吸灯灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_breath_entry(void *parameter)
{
    rt_uint16_t brightness;
    
    while (1)
    {
        /* 渐亮 */
        for (brightness = 0; brightness <= 255; brightness += 5)
        {
            ws2811_set_all(brightness, brightness, brightness);
            ws2811_update();
            rt_thread_mdelay(20);
        }
        
        /* 渐暗 */
        for (brightness = 255; brightness > 0; brightness -= 5)
        {
            ws2811_set_all(brightness, brightness, brightness);
            ws2811_update();
            rt_thread_mdelay(20);
        }
    }
}

/**
 * @brief  彩虹灯效线程入口
 * @param  parameter: 线程参数(未使用)
 */
static void ws2811_rainbow_entry(void *parameter)
{
    rt_uint16_t hue = 0;
    rt_uint8_t i;
    rt_uint8_t r, g, b;
    
    while (1)
    {
        for (i = 0; i < WS2811_LED_NUM; i++)
        {
            rt_uint16_t pixel_hue = (hue + (i * 65536 / WS2811_LED_NUM)) % 65536;
            
            /* HSV转RGB (简化版) */
            if (pixel_hue < 21845)  /* 红->绿 */
            {
                r = 255 - (pixel_hue * 255 / 21845);
                g = pixel_hue * 255 / 21845;
                b = 0;
            }
            else if (pixel_hue < 43690)  /* 绿->蓝 */
            {
                r = 0;
                g = 255 - ((pixel_hue - 21845) * 255 / 21845);
                b = (pixel_hue - 21845) * 255 / 21845;
            }
            else  /* 蓝->红 */
            {
                r = (pixel_hue - 43690) * 255 / 21846;
                g = 0;
                b = 255 - ((pixel_hue - 43690) * 255 / 21846);
            }
            
            ws2811_set_color(i, r, g, b);
        }
        
        ws2811_update();
        hue += 256;
        if (hue >= 65536) hue = 0;
        rt_thread_mdelay(10);
    }
}

/* ==================== 测试函数 ==================== */

/**
 * @brief  测试函数：依次点亮红绿蓝 (循环运行)
 */
void ws2811_test_rgb(void)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
