applevald/gd32f303_project/mainapp/color_light.c
    light_thread = rt_thread_create("led_rgb",
                             ws2811_rgb_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: RGB loop started in background.\n");
    }
}

/**
 * @brief  测试函数：流水灯效果 (循环运行)
 */
void ws2811_test_flow(void)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_flow",
                             ws2811_flow_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: Flow effect started in background.\n");
    }
}

/**
 * @brief  测试函数：呼吸灯效果 (循环运行)
 */
void ws2811_test_breath(void)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_breath",
                             ws2811_breath_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: Breathing effect started in background.\n");
    }
}

/**
 * @brief  测试函数：彩虹灯效果 (循环运行)
 */
void ws2811_test_rainbow(void)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    light_thread = rt_thread_create("led_rainbow",
                             ws2811_rainbow_entry, RT_NULL,
                             1024, 25, 10);
                             
    if (light_thread != RT_NULL)
    {
        rt_thread_startup(light_thread);
        rt_kprintf("WS2811: Rainbow effect started in background.\n");
    }
}

/**
 * @brief  测试函数：单色测试
 */
void ws2811_test_color(int r, int g, int b)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    ws2811_set_all(r, g, b);
    ws2811_update();
    rt_kprintf("WS2811: Set all LEDs to RGB(%d,%d,%d)\n", r, g, b);
}

/**
 * @brief  测试函数：单个LED测试
 * @param  index: LED索引 (0-2)
 * @param  r: 红色
 * @param  g: 绿色  
 * @param  b: 蓝色
 */
void ws2811_test_single(int index, int r, int g, int b)
{
    /* 初始化 */
    ws2811_init();
    
    ws2811_stop_effect();  /* 停止旧线程 */
    
    /* 打印调试信息 */
    rt_kprintf("WS2811: Parameters - index=%d, r=%d, g=%d, b=%d\n", index, r, g, b);
    
    /* 关闭所有LED */
    ws2811_set_all(0, 0, 0);
    
    /* 只点亮指定的LED */
    if (index >= 0 && index < (int)WS2811_LED_NUM)
    {
        ws2811_set_color((rt_uint8_t)index, (rt_uint8_t)r, (rt_uint8_t)g, (rt_uint8_t)b);
        ws2811_update();
        rt_kprintf("WS2811: Set LED[%d] to RGB(%d,%d,%d)\n", index, r, g, b);
    }
    else
    {
        rt_kprintf("WS2811: Invalid LED index %d (valid range: 0-%d)\n", index, WS2811_LED_NUM-1);
    }
}

/**
 * @brief  测试函数：单个LED测试 (LED0)
 */
static int ws2811_led0(int argc, char **argv)
{
    int r, g, b;
    
    if (argc != 4) {
        rt_kprintf("Usage: ws2811_led0 <r> <g> <b>\n");
        return -1;
    }
    
    r = atoi(argv[1]);
    g = atoi(argv[2]);
    b = atoi(argv[3]);
    
    ws2811_init();
    ws2811_stop_effect();
    ws2811_set_all(0, 0, 0);
    ws2811_set_color(0, (rt_uint8_t)r, (rt_uint8_t)g, (rt_uint8_t)b);
    ws2811_update();
    rt_kprintf("WS2811: LED0 RGB(%d,%d,%d)\n", r, g, b);
    return 0;
}
MSH_CMD_EXPORT(ws2811_led0, Test LED0: ws2811_led0 <r> <g> <b>);

/**
 * @brief  打印颜色缓冲区数据(调试用)
 */
static int ws2811_dump(int argc, char **argv)
{
    rt_uint8_t i;
    
    rt_kprintf("WS2811 Buffer (9 bytes for 3 LEDs in GRB format):\n");
    for (i = 0; i < sizeof(ws2811_color_buffer); i++)
    {
        rt_kprintf("Byte[%d]=0x%02X ", i, ws2811_color_buffer[i]);
        if ((i + 1) % 3 == 0) {
            rt_kprintf("  (LED%d: G=%d R=%d B=%d)\n", 
                i/3, 
                ws2811_color_buffer[(i/3)*3], 
                ws2811_color_buffer[(i/3)*3+1], 
                ws2811_color_buffer[(i/3)*3+2]);
        }
    }
    return 0;
}
MSH_CMD_EXPORT(ws2811_dump, Dump color buffer data);

/**
 * @brief  测试函数：单个LED测试 (LED1)
 */
static int ws2811_led1(int argc, char **argv)
{
    int r, g, b;
    rt_uint8_t i;
    
    if (argc != 4) {
        rt_kprintf("Usage: ws2811_led1 <r> <g> <b>\n");
        return -1;
    }
    
    r = atoi(argv[1]);
    g = atoi(argv[2]);
    b = atoi(argv[3]);
    
    ws2811_init();
    ws2811_stop_effect();
    ws2811_set_all(0, 0, 0);
    ws2811_set_color(1, (rt_uint8_t)r, (rt_uint8_t)g, (rt_uint8_t)b);
    
    /* 打印缓冲区内容 */
    rt_kprintf("Buffer content:\n");
    for (i = 0; i < sizeof(ws2811_color_buffer); i++) {
        rt_kprintf("0x%02X ", ws2811_color_buffer[i]);
    }
    rt_kprintf("\n");
    
    ws2811_update();
    rt_kprintf("WS2811: LED1 RGB(%d,%d,%d)\n", r, g, b);
    return 0;
}
MSH_CMD_EXPORT(ws2811_led1, Test LED1: ws2811_led1 <r> <g> <b>);

/**
 * @brief  测试函数：单个LED测试 (LED2)
 */
static int ws2811_led2(int argc, char **argv)
{
    int r, g, b;
    rt_uint8_t i;
    
    if (argc != 4) {
        rt_kprintf("Usage: ws2811_led2 <r> <g> <b>\n");
        return -1;
    }
    
    r = atoi(argv[1]);
    g = atoi(argv[2]);
    b = atoi(argv[3]);
    
    ws2811_init();
    ws2811_stop_effect();
    ws2811_set_all(0, 0, 0);
    ws2811_set_color(2, (rt_uint8_t)r, (rt_uint8_t)g, (rt_uint8_t)b);
    
    /* 打印缓冲区内容 */
    rt_kprintf("Buffer content:\n");
    for (i = 0; i < sizeof(ws2811_color_buffer); i++) {
        rt_kprintf("0x%02X ", ws2811_color_buffer[i]);
    }
    rt_kprintf("\n");
    
    ws2811_update();
    rt_kprintf("WS2811: LED2 RGB(%d,%d,%d)\n", r, g, b);
    return 0;
}
MSH_CMD_EXPORT(ws2811_led2, Test LED2: ws2811_led2 <r> <g> <b>);

/* MSH命令导出 */
#ifdef RT_USING_FINSH
#include <finsh.h>
MSH_CMD_EXPORT(ws2811_init, Initialize WS2811 LED driver (Software SPI));
MSH_CMD_EXPORT(ws2811_clear, Turn off all LEDs);
MSH_CMD_EXPORT(ws2811_hard_reset, Hard reset WS2811 to clear locked state);
MSH_CMD_EXPORT(ws2811_stop_effect, Stop current lighting effect);
MSH_CMD_EXPORT(ws2811_test_rgb, Start RGB loop (background));
MSH_CMD_EXPORT(ws2811_test_flow, Start flow effect (background));
MSH_CMD_EXPORT(ws2811_test_breath, Start breathing effect (background));
MSH_CMD_EXPORT(ws2811_test_rainbow, Start rainbow effect (background));
#endif

#endif
